{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "W_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "W_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_layer/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "B_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "B_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MatMul", "op": "MatMul", "input": ["X", "W"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add", "op": "Add", "input": ["B", "MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"seed": {"i": "404"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "29"}}}, {"name": "dropout_layer/add", "op": "Add", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Floor", "op": "Floor", "input": ["dropout_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_layer/truediv_recip", "dropout_layer/Floor"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_layer/mul", "op": "Mul", "input": ["Relu", "dropout_layer/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["dropout_layer/mul", "W_1"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "add_1", "op": "Add", "input": ["B_1", "MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_2", "op": "MatMul", "input": ["Relu_1", "W_2"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add_2", "op": "Add", "input": ["B_2", "MatMul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Softmax_3", "op": "Softmax", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["Softmax_3", "accuracy_calc/prediction/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "W_2", "shape": [64, 10], "dtype": "float32"}, {"name": "W_1", "shape": [512, 64], "dtype": "float32"}, {"name": "dropout_layer/sub", "shape": [], "dtype": "float32"}, {"name": "W", "shape": [784, 512], "dtype": "float32"}, {"name": "B", "shape": [512], "dtype": "float32"}, {"name": "ConstantFolding/dropout_layer/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "B_1", "shape": [64], "dtype": "float32"}, {"name": "B_2", "shape": [10], "dtype": "float32"}]}]}